
const contact = {
    name: 'Neva',
    wechat: 'Neva889900',
    wechatUrl: 'weixin://Neva889900',
    mobile: '09174094367',
    mobileUrl: 'tel://09174094367',
    bookUrl: 'https://docs.google.com/forms/d/e/1FAIpQLSeDQQTC095RgBhI3VkjdcdFCY-G1F7GUtItxhyWZ-daYOd7jQ/viewform?entry.672735455=%E9%BB%91%E6%B5%B7%E6%BB%A9%E4%B8%80%E6%97%A5%E6%B8%B8&entry.1509848516=2019-06-01&entry.1072873268=v&entry.554966761=32',
    mapUrl: 'https://map.google.com'
}


const robotQA = [
    //包括和不包括
    {
        question: ['包含','包括','有哪些','有什么'],
        answer: [
            '旅游价格包含了旅游期间的交通费、司机和带队的小费以及部分景点门票。不包含餐费和部分门票及额外项目费。',
        ]
    },
    //体验项目
    {
        question: ['潜水','浮潜','深潜','盔潜'],
        answer: [
            '潜水有“盔潜”和“浮潜”两种。头盔潜水不用会游泳，很安全的。浮潜穿上救生衣不会游泳同样也安全哟。',
        ]
    },
    //日期时间
    {
        question: ['几点','时间','凌晨','早晨','晚上','夜晚','半夜','三更'],
        answer: [
            `出发时间一般是当天的凌晨或前一天的晚上。辛苦点要在车上睡觉节约游玩时间哦。可以加微信 ${contact.wechat} 或者打电话 ${contact.mobile} 了解出发日期和时间。`,
        ]
    },
    {
        question: ['哪天','日期','星期','几号','周一','周二','周三','周四','周五','周六','周日','月','年'],
        answer: [
            `一日游的出发日期需要向客服咨询唷，请加微信 ${contact.wechat} 或者打电话 ${contact.mobile} 了解出发日期和时间。`,
        ]
    },
    //地点
    {
        question: ['集合','地点','位置','地方','汇合'],
        answer: [
            `集合地点会是在 MOA 或者 Green Field 这两个地方之一，偶尔也会有其它集合地点。请加微信 ${contact.wechat} 或者打电话 ${contact.mobile} 了解出发的确切集合位置。`,
        ]
    },
    {
        question: ['行程','日程','计划','安排'],
        answer: [
            `点开感兴趣的一日游，会看到一日游的日程安排。可以保证主要安排，但次要日程会根据天气或其它实际情况有所调整。`,
        ]
    },

    //价格 订金 旅游费 退款
    {
        question: ['价格','多少钱','花费','费用'],
        answer: [
            `不同旅游目的地和娱乐项目的价格不同哦。 具体请您咨询客服请加微信 ${contact.wechat} 或者打电话 ${contact.mobile} `,
        ]
    },
    {
        question: ['太贵','便宜','特价','优惠','促销','打折','折扣','有点贵','很贵','降价','涨价'],
        answer: [
            `我们已经在保障旅游品质情况下尽量压低团费，定价已经是最优惠价格了。如果与您一起旅游的人数达到15人除可单独发团外，可以再优惠。具体请您咨询客服请加微信 ${contact.wechat} 或者打电话 ${contact.mobile} `,
        ]
    },
    {
        question: ['支付方式','支付方法','peso','比索','人民币','外汇','美元','php','$','￥','钱包','微信支付','支付宝'],
        answer: [
            '订金可以用微信支付人民币或者GCash支付比索两种方式。余款支付只接受现金的比索这一种方式。',
        ]
    },
    {
        question: ['预约','预订','预定','订金','定金','支付','付钱','付款','余款','尾款'],
        answer: [
            '在线预订是免费的，支付订金是为了作为保留座位的依据。在出发之前需要支付剩余的尾款。',
        ]
    },
    {
        question: ['退款','退订金','退定金','退钱'],
        answer: [
            '若旅游团因某种原因取消出发，您可以选择退订金或者作为下次的一日游订金。若旅游团正常出发而您因故没来，订金是不退也不能作为下次订金的唷。',
        ]
    },
    //行李
    {
        question: ['挎包','行李','箱','背包','大包','小包'],
        answer: [
            '可以携带小背包，但不能携带行李箱。如果有大行李箱您必须先找地方寄存或放朋友那里。',
        ]
    },
    //衣服
    {
        question: ['鞋','背心','恤','外套','衣','裤','裙'],
        answer: [
            '在海滩穿拖鞋或沙滩鞋。穿短衣短裤或短裙，准备薄的长衣裤防晒或御寒。',
        ]
    },
    {
        question: ['泳衣','泳裤'],
        answer: [
            '水上项目是需要携带泳衣泳裤的，如果怕晒可以准备长衣裤的泳衣泳裤。',
        ]
    },
    //装备
    {
        question: ['泳镜','潜水镜','蹼','呼吸管','氧气'],
        answer: [
            '不必买和携带哦，那里是提供的租的。',
        ]
    },
    //防晒
    {
        question: ['伞','太阳镜','墨镜','防晒'],
        answer: [
            '防晒措施是可以的哦。',
        ]
    },
    //危险
    {
        question: ['海胆','海星','蜇','水母','溺水','淹死','鲨','食人'],
        answer: [
            '那个区域没有危险生物，而且有安全措施来保障安全的。但您需要按照带队和工作人员的安排哦。',
        ]
    },
    {
        question: ['安全','危险','事故','伤','残','疾','病','死','亡','保险','惨'],
        answer: [
            '游玩是开心的，旅途中需要提高安全意识，听从工作人员的建议确保平安旅游。',
        ]
    },
    {
        question: ['抢劫','杀人','强奸','绑架','勒索','打仗','打架','盗窃','小偷','宰客','敲诈','强迫'],
        answer: [
            '尽管放心，旅游全程都是安全的，不会发生这样的事情。',
        ]
    },
    //人
    {
        question: ['多少人','几人','个人','人数','一人','两人','三人','四人','五人','六人','七人','八人','九人','十人'],
        answer: [
            '一个团会有十几个人。如果您与朋友能凑够一定人数，可以单独为您发专车旅游团哦。',
        ]
    },
    {
        question: ['菲律宾人','中国人','大陆人'],
        answer: [
            '旅游团里中菲游客都会有的，因为我们团费便宜有很多菲律宾人也会报团。',
        ]
    },
    //语言
    {
        question: ['语言','不通','听不懂','汉语','中文','英语','英文','他加禄','tagalog','english','chinese','philipino','philipina'],
        answer: [
            '沟通上可以打电话给客服，客服会帮您与带队沟通。此外，凭以往游客经验跟着带队走就好了，她会带游客和使用谷歌翻译沟通。',
        ]
    },
    //餐饮
    {
        question: ['烤','食','吃','零食','餐','饭','饮料','喝','酒','威士忌','白兰地','xo','vsop','beer','wine'],
        answer: [
            '那边是有提供餐饮的，带钱即可。路上稍准备些零食和水即可。行程中禁止饮酒哦。',
        ]
    },
    //导游
    {
        question: ['导游','带队','司机'],
        answer: [
            '有带队引导司机和带着大家游玩和安排各种事情的，都是专业的哦。不过带队与导游风格是不一样的，没有强迫购物之类的事情哦。',
        ]
    },
    //交通
    {
        question: ['车','交通','高速'],
        answer: [
            '通常是丰田或福田面包车，舒适性几乎是一样的。大多数是走高速路，平稳。',
        ]
    },
    {
        question: ['飞机','直升机','直升飞机','客机','航空'],
        answer: [
            '交通上不会乘飞机哦。有些娱乐项目会有搭乘轻型飞机或直升机。',
        ]
    },
    {
        question: ['船'],
        answer: [
            '有些旅游目的地会有乘渡船或蜘蛛船，是安全的。',
        ]
    }
    //目的地名，娱乐项目名
]
const robotChat = [
    {
        question: ['女朋友','男朋友','女友','男友','恋人','妻子','丈夫','老婆','老公','小三','小秘'],
        answer: [
            '旅游是很适合发展恋情的美好体验哟。旅游过程中没尬聊，非常适合深入情感交流的~~~',
        ]
    },
    {
        question: ['同事','家人','亲戚','亲人','朋友'],
        answer: [
            '旅游的方式聚会更好玩和特别一些。',
        ]
    },
    {
        question: ['爱你','喜欢你','想你','520','521','love','like'],
        answer: [
            '谢谢亲哟！❤ 么么哒 :)',
        ]
    },
    {
        question: ['讨厌','嫌弃','不喜欢'],
        answer: [
            '虽然不是很理解为什么，但是尊重这份感受。。。经常旅游可以让人快乐起来的',
        ]
    },
    {
        question: ['喜欢','爱','恋'],
        answer: [
            '不要忽视一起旅游对浪漫美好感情的促进作用哦',
        ]
    }
]
function robot(question){
    if (question.trim()==='') {
        return '想问什么？'
    } else {
        for (item of robotQA) {
            for (qKeyword of item.question) {
                if (question.includes(qKeyword)) {
                    const randomIndex = parseInt(Math.random()*item.answer.length)
                    return item.answer[randomIndex] 
                }
            }
        }
        for (item of robotChat) {
            for (qKeyword of item.question) {
                if (question.includes(qKeyword)) {
                    const randomIndex = parseInt(Math.random()*item.answer.length)
                    return item.answer[randomIndex] 
                }
            }
        }
        return `不是很理解问题唉，换个说法也许我能懂。或者联系人类客服${contact.name}，她的微信是${contact.wechat}。`
    }
}
